package webtest.keys;

public enum ActionType {
    /*****************************************************************
     * ページ遷移／ブラウザ操作系の処理
     *****************************************************************/
    // ページを表示
    OPEN,
    // ページ遷移
    NAVIGATE,
    // １つ戻る
    BACK,
    // １つ進む
    FORWARD,
    // ページ更新
    REFRESH,
    // 待機
    WAIT,
    // ウィンドウハンドル取得
    GETWINHANDLE,
    // ウィンドウを切り替える
    WINSWITCH,
    // ウィンドウを閉じる
    CLOSE,
    // ウィンドウサイズを変更
    WINSIZE,

    /*****************************************************************
     * 取得系の処理
     *****************************************************************/
    // 現在のURLを取得
    GETURL,
    // タイトルを取得
    GETTITLE,
    // テキストを取得
    GETTEXT,
    // 属性を取得
    GETATTR,
    // スクリーンショットをファイルに保存
    SAVECAPTURE,

    /*****************************************************************
     * 入力／操作系の処理
     *****************************************************************/
    // キーボードからの入力
    SENDKEY,
    // ドロップダウン選択
    SELECT,
    // クリック
    CLICK,
    // スクロール
    SCROLL,
    // スクリプト実行
    EXECSCRIPT,

    /*****************************************************************
     * Selenium以外の操作
     *****************************************************************/
    // なにもしない（シナリオのメモ用）
    NONE,
    // 変数に値をセットする
    SETVAL,
    // ログ出力
    LOG,

    /*****************************************************************
     * シナリオ制御アクション
     *****************************************************************/
    // 繰り返し処理
    FOR,
    ENDFOR;

    /**
     * 子アクション開始タグかどうか
     * @return
     */
    public boolean startChildAction() {
        if (this.equals(FOR)) {
            return true;
        } else {
            return false;
        }
    }

    /**
     * 子アクション終了タグかどうか
     * @return
     */
    public boolean endChildAction() {
        if (this.equals(ENDFOR)) {
            return true;
        } else {
            return false;
        }
    }
}
