package webtest.keys;

public enum ActionType {
    /*****************************************************************
     * ページ遷移／ブラウザ操作系の処理
     *****************************************************************/
    // ページを表示
    OPEN,
    // ページ遷移
    NAVIGATE,
    // １つ戻る
    BACK,
    // １つ進む
    FORWARD,
    // ページ更新
    REFRESH,
    // 待機
    WAIT,
    // ウィンドウを閉じる
    CLOSE,
    // ウィンドウサイズをセット
    WINSIZE,

    /*****************************************************************
     * 取得系の処理
     *****************************************************************/
    // 現在のURLを取得
    GETURL,
    // タイトルを取得
    GETTITLE,
    // テキストを取得
    GETTEXT,
    // 属性を取得
    GETATTR,
    // スクリーンショットをファイルに保存
    SAVECAPTURE,

    /*****************************************************************
     * 入力／操作系の処理
     *****************************************************************/
    // キーボードからの入力
    SENDKEY,
    // ドロップダウン選択
    SELECT,
    // クリック
    CLICK,
    // スクロール
    SCROLL
}
